todoApp/app/controllers/api/todos_controller.rb

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "todos" SET "title" = $1, "body" = $2, "updated_at" = $3 WHERE "todos"."id" = $4  [["title", "workout2"], ["body", "leg day"], ["updated_at", "2021-01-08 21:54:09.052902"], ["id", 1]]
---
    def update
        @todo = Todo.find(params[:id])
        if @todo.update(todo_params)

SELECT  "todos".* FROM "todos" WHERE "todos"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
DELETE FROM "todos" WHERE "todos"."id" = $1  [["id", 3]]
---
    def destroy
        @todo = Todo.find(params[:id])
        if @todo && @todo.destroy